src/Catalogs/FL_Jobs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>FL_Jobs</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.FL_Exchanges</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Continuations</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedAt</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpireAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MetadataObject</Name>
					<Comment>Provides access to the metadata object name.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Priority</Name>
					<Comment>Job priority.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Comment>Provides the essential members for describing a background job state.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>InvocationContext</Name>
					<Comment>Serialized invocation data into XML. </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Filter</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NamespaceURI</Name>
							<Comment>URI of the name space, to which the XML type belongs.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PrimaryKey</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TypeName</Name>
							<Comment>A representation XML data type by XML type name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XMLValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SessionContext</Name>
					<Comment>Provides access to the runtime session context.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MetadataObject</Name>
							<Comment>Provides access to the metadata object name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Session</Name>
							<Comment>Semi-permanent interactive information interchange.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ValueStorage</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SubscriberResources</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Subscribers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Completed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SubscribersLog</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LogAttribute</Name>
							<Comment>Detailed log of the channel operations.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OriginalResponse</Name>
							<Comment>Original response from channel.</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StatusCode</Name>
							<Comment>State (reply) code returned by the HTTP service.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StringResponse</Name>
							<Comment>Response represented as string.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Success</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/FL_Exchanges.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>FL_Exchanges</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BasicFormatGuid</Name>
					<Comment>Guid which is used to identify different implementations of specific format.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InUse</Name>
					<Comment>Specifies that the exchange is used.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Version</Name>
					<Comment>Numbers to unique the state of this exchange.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ChannelResources</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExecutableCode</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Channels</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Events</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>EventFilterDCSchema</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EventFilterDCSettings</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EventHandler</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EventName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MetadataObject</Name>
							<Comment>Provides access to the metadata object name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Transactional</Name>
							<Comment>Method creates implicit transactions.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Operations</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>APISchema</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CanUseExternalFunctions</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DataCompositionSchema</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DataCompositionSettings</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Invoke</Name>
							<Comment>Helps to trigger all subordinate jobs during single call.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Isolated</Name>
							<Comment>Helps to protect each job from other jobs.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OperationDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Priority</Name>
							<Comment>Default job priority.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/FL_Event_BulkELK/Ext/Module.bsl
#Region ProgramInterface

// Returns a processing result.
//
// Parameters:
//  Exchange - CatalogRef.FL_Exchanges - reference of the FL_Exchanges catalog.
//  Message  - CatalogRef.FL_Messages  - reference of the FL_Messages catalog.
//
// Returns:
//  Structure - see fucntion Catalogs.FL_Jobs.NewJobResult. 
//
Function ProcessMessage(Exchange, Message) Export
    
    Operation = FL_CommonUse.ObjectAttributeValue(Message, "Operation");
    If Operation = Catalogs.FL_Operations.Create Then
        Return CreateApdex(Exchange, Message);
    EndIf;
  
EndFunction // ProcessMessage()

#EndRegion // ProgramInterface

#Region ServiceInterface

// Returns the external event handler info structure for this module.
//
// Returns:
//  Structure - see function FL_InteriorUse.NewExternalEventHandlerInfo.
//
Function EventHandlerInfo() Export
    
    EventHandlerInfo = FL_InteriorUse.NewExternalEventHandlerInfo();
	EventHandlerInfo.Version = "0.8";    
    EventHandlerInfo.Description = StrTemplate(NStr("
            |en='ELK bulk event handler, ver. %1.';
            |ru='Обработчик события при операции bulk в ELK, вер. %1.'"), 
        EventHandlerInfo.Version);
    EventHandlerInfo.EventHandler = "омСобытияFoxyLink_BulkELK.ProcessMessage";
       
    EventSources = New Array;
    EventSources.Add(Upper("HTTPService.FL_AppEndpoint"));
    EventSources.Add(Upper("HTTPСервис.FL_AppEndpoint"));
    EventSources.Add(Upper("Catalog.*"));
    EventSources.Add(Upper("Справочник.*"));
    EventSources.Add(Upper("Document.*"));
    EventSources.Add(Upper("Документ.*"));
    EventSources.Add(Upper("ChartOfCharacteristicTypes.*"));
    EventSources.Add(Upper("ПланВидовХарактеристик.*"));
    EventSources.Add(Upper("InformationRegister.*"));
    EventSources.Add(Upper("РегистрСведений.*"));
    EventSources.Add(Upper("AccumulationRegister.*"));
    EventSources.Add(Upper("РегистрНакопления.*"));
		
    EventHandlerInfo.Publishers.Insert(Catalogs.FL_Operations.Create, 
        EventSources); 
               
    Return FL_CommonUse.FixedData(EventHandlerInfo);
    
EndFunction // EventHandlerInfo()

#EndRegion // ServiceInterface

#Region ServiceProceduresAndFunctions

// Only for internal use.
//
Function CreateApdex(Exchange, Message)
    
    JobResult = Catalogs.FL_Jobs.NewJobResult();
    
	Try
		
        Settings = Catalogs.FL_Exchanges.ExchangeSettingsByRefs(Exchange, Message.Operation);
        StreamObject = FL_InteriorUse.NewFormatProcessor(
            Settings.BasicFormatGuid);
        
        // Open new memory stream and initialize format processor.
        Stream = New MemoryStream;
        StreamObject.Initialize(Stream, Settings.APISchema);
        
        OutputParameters = Catalogs.FL_Exchanges.NewOutputParameters(Settings, 
            Catalogs.FL_Messages.DeserializeContext(Message));
                    
        FL_DataComposition.Output(StreamObject, OutputParameters);
        
        // Fill MIME-type information.
        Properties = Catalogs.FL_Exchanges.NewProperties();
        FillPropertyValues(Properties, Message);
        Properties.ContentType = FormatMediaType();
        Properties.ContentEncoding = StreamObject.ContentEncoding;
        Properties.FileExtension = StreamObject.FormatFileExtension();
        Properties.MessageId = Message.Code;
        
        // Close format stream and memory stream.
        StreamObject.Close();
        Payload = Stream.CloseAndGetBinaryData();
				
		StreamReader = Payload.OpenStreamForRead();
		StreamReaderToJson = New JSONReader;		
		StreamReaderToJson.OpenStream(StreamReader, Properties.ContentEncoding);		
		ReadResult = ReadJSON(StreamReaderToJson);
		StreamReader.Close();
		
		If TypeOf(ReadResult) <> Type("Массив") Then
			Raise "JSON для отправки в ELK с помощью операции bulk должен быть массивом";
		EndIf;
		
		If ReadResult.Count() = 0 Then
			Raise "JSON для отправки в ELK с помощью операции bulk пустой";
		EndIf;
		
		CRLF = Chars.CR + Chars.LF;
	    StreamForBulk = New MemoryStream;
	    StreamWriterForBulk = New JSONWriter;		
	    StreamWriterForBulk.ValidateStructure = False;
		JSONWriterSettings = Новый JSONWriterSettings(JSONLineBreak.None);
	    StreamWriterForBulk.OpenStream(StreamForBulk, Properties.ContentEncoding,, JSONWriterSettings);
		
		For Each Element In ReadResult Do
						
			StreamWriterForBulk.WriteRaw("{""index"":{}}");	
			StreamWriterForBulk.WriteRaw(CRLF);			
			WriteJSON(StreamWriterForBulk, Element);		  
			StreamWriterForBulk.WriteRaw(CRLF);
					    			
		EndDo; 
		
	    StreamWriterForBulk.Close();
	    Payload = StreamForBulk.CloseAndGetBinaryData();						
        
        JobResult.StatusCode = FL_InteriorUseReUse.OkStatusCode();
        
        Catalogs.FL_Jobs.AddToJobResult(JobResult, "Payload", Payload);     
        Catalogs.FL_Jobs.AddToJobResult(JobResult, "Properties", Properties); 

    Except
        
        FL_InteriorUse.WriteLog("омСобытияFoxyLink_BulkELK.ProcessMessage", 
            EventLogLevel.Error,
            Metadata.Catalogs.FL_Exchanges,
            ErrorDescription(),
            JobResult);
            
    EndTry;
    
    JobResult.Success = FL_InteriorUseReUse.IsSuccessHTTPStatusCode(
        JobResult.StatusCode);
    Return JobResult;

    
EndFunction 

// Returns format media type.
//
// Returns:
//  String - format media type.
//
Function FormatMediaType() Export
    
    Return "application/x-ndjson";
    
EndFunction // FormatMediaType()


#EndRegion // ServiceProceduresAndFunctions
